fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбоненскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ВидДоговора) Тогда
		ДобавитьПоляАбонентскогоДоговора();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	ДобавитьПоляАбонентскогоДоговора();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляАбонентскогоДоговора()
	
	//++ Цвелева Дарья Добавление полей ввода, если вид договора "Абоненское обслуживание"	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		ПолеВводаДатаНач = Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"));
		ПолеВводаДатаНач.Вид = ВидПоляФормы.ПолеПериода;
		ПолеВводаДатаНач.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
		
		ПолеВводаДатаОкон = Элементы.Добавить("ОкончаниеДействияДоговора", Тип("ПолеФормы"));
		ПолеВводаДатаОкон.Вид = ВидПоляФормы.ПолеПериода;
		ПолеВводаДатаОкон.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";	
		
		ПолеВводаСтоимостьЧаса = Элементы.Добавить("СтоимостьЧаса", Тип("ПолеФормы"));
		ПолеВводаСтоимостьЧаса.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаСтоимостьЧаса.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
		
		ПолеВводаАбПлата = Элементы.Добавить("АбоненскаяПлата", Тип("ПолеФормы"));
		ПолеВводаАбПлата.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаАбПлата.ПутьКДанным = "Объект.ВКМ_АбоненскаяПлата";
		
	КонецЕсли;
	//--	
	
КонецПроцедуры

#КонецОбласти
